tutorials/Mech/FTMChemkinToFoam/CH4.oneStep/constant/TranportCoeffDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      TranCoeff;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

species
(
    CH4
    H2O
    O2
    CO2
    N2
);

CH4
{
    fittingTranCoeff
    {
        muCoeffs    (-22.2457 3.54364 -0.383872 0.0169568);
        kappaCoeffs    (0.812318 -4.54742 0.975145 -0.0536628);
        DijCoeffs    (
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-30.6998 5.62052 -0.483426 0.0197159)
                        (-25.3927 3.75885 -0.275697 0.0120551)
                        (-28.4471 4.81747 -0.406845 0.0174929)
                        (-25.0853 3.63653 -0.260141 0.0113939)
                     );
    }
};

H2O
{
    fittingTranCoeff
    {
        muCoeffs    (-12.9653 -1.33484 0.41556 -0.0238812);
        kappaCoeffs    (12.2672 -9.14258 1.55383 -0.077075);
        DijCoeffs    (
                        (-30.6998 5.62052 -0.483426 0.0197159)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-30.453 5.60295 -0.492151 0.0205307)
                        (-30.1572 5.09926 -0.39041 0.0146768)
                        (-30.2612 5.5433 -0.487098 0.020417)
                     );
    }
};

O2
{
    fittingTranCoeff
    {
        muCoeffs    (-19.3405 2.62765 -0.265133 0.0118167);
        kappaCoeffs    (-13.8944 3.07851 -0.297333 0.0127535);
        DijCoeffs    (
                        (-25.3927 3.75885 -0.275697 0.0120551)
                        (-30.453 5.60295 -0.492151 0.0205307)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-27.6164 4.47195 -0.36524 0.0158195)
                        (-24.3747 3.3315 -0.221273 0.00973849)
                     );
    }
};

CO2
{
    fittingTranCoeff
    {
        muCoeffs    (-26.3191 5.15021 -0.575259 0.0245432);
        kappaCoeffs    (-23.1246 5.98573 -0.583197 0.0210317);
        DijCoeffs    (
                        (-28.4471 4.81747 -0.406845 0.0174929)
                        (-30.1572 5.09926 -0.39041 0.0146768)
                        (-27.6164 4.47195 -0.36524 0.0158195)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-27.3144 4.3644 -0.352369 0.0153064)
                     );
    }
};

N2
{
    fittingTranCoeff
    {
        muCoeffs    (-18.7928 2.3564 -0.229683 0.0102714);
        kappaCoeffs    (1.73563 -3.66431 0.664846 -0.0328505);
        DijCoeffs    (
                        (-25.0853 3.63653 -0.260141 0.0113939)
                        (-30.2612 5.5433 -0.487098 0.020417)
                        (-24.3747 3.3315 -0.221273 0.00973849)
                        (-27.3144 4.3644 -0.352369 0.0153064)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                     );
    }
};

CH4
{
    fittingTranCoeff
    {
        muCoeffs    (-22.2457 3.54364 -0.383872 0.0169568);
        kappaCoeffs    (0.812318 -4.54742 0.975145 -0.0536628);
        DijCoeffs    (
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-30.6998 5.62052 -0.483426 0.0197159)
                        (-25.3927 3.75885 -0.275697 0.0120551)
                        (-28.4471 4.81747 -0.406845 0.0174929)
                        (-25.0853 3.63653 -0.260141 0.0113939)
                     );
    }
};

H2O
{
    fittingTranCoeff
    {
        muCoeffs    (-12.9653 -1.33484 0.41556 -0.0238812);
        kappaCoeffs    (12.2672 -9.14258 1.55383 -0.077075);
        DijCoeffs    (
                        (-30.6998 5.62052 -0.483426 0.0197159)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-30.453 5.60295 -0.492151 0.0205307)
                        (-30.1572 5.09926 -0.39041 0.0146768)
                        (-30.2612 5.5433 -0.487098 0.020417)
                     );
    }
};

O2
{
    fittingTranCoeff
    {
        muCoeffs    (-19.3405 2.62765 -0.265133 0.0118167);
        kappaCoeffs    (-13.8944 3.07851 -0.297333 0.0127535);
        DijCoeffs    (
                        (-25.3927 3.75885 -0.275697 0.0120551)
                        (-30.453 5.60295 -0.492151 0.0205307)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-27.6164 4.47195 -0.36524 0.0158195)
                        (-24.3747 3.3315 -0.221273 0.00973849)
                     );
    }
};

CO2
{
    fittingTranCoeff
    {
        muCoeffs    (-26.3191 5.15021 -0.575259 0.0245432);
        kappaCoeffs    (-23.1246 5.98573 -0.583197 0.0210317);
        DijCoeffs    (
                        (-28.4471 4.81747 -0.406845 0.0174929)
                        (-30.1572 5.09926 -0.39041 0.0146768)
                        (-27.6164 4.47195 -0.36524 0.0158195)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                        (-27.3144 4.3644 -0.352369 0.0153064)
                     );
    }
};

N2
{
    fittingTranCoeff
    {
        muCoeffs    (-18.7928 2.3564 -0.229683 0.0102714);
        kappaCoeffs    (1.73563 -3.66431 0.664846 -0.0328505);
        DijCoeffs    (
                        (-25.0853 3.63653 -0.260141 0.0113939)
                        (-30.2612 5.5433 -0.487098 0.020417)
                        (-24.3747 3.3315 -0.221273 0.00973849)
                        (-27.3144 4.3644 -0.352369 0.0153064)
                        (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                     );
    }
};
