tutorials/Mech/FTMChemkinToFoam/CH4.oneStep/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
usingDetailedTransportModel  false;
usingCoThermPhys             false;
usingTransportPreProcessing  true;

coThermPhyMajorSpecies (CH4 O2 CO2 H2O);
epsilonT          0.1;
epsilonP          100;
epsilonSpecies    0.001;

thermoType
{
    type            hePsiThermo;
    mixture         DTMMultiComponentMixture;
    transport       preprocessingFTMTransport;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}


inertSpecie H2O;

#include "thermo.DTM"

// ************************************************************************* //
